In [1]:
import matplotlib.pyplot
import pandas
import scipy.stats
import numpy as np

In [2]:
# lecture du csv et affichage
prenoms = pandas.read_csv("Prénoms/nat2019.csv", header = 0, sep = ";")
prenoms

        sexe        preusuel annais  nombre
0          1  _PRENOMS_RARES   1900    1250
1          1  _PRENOMS_RARES   1901    1340
2          1  _PRENOMS_RARES   1902    1329
3          1  _PRENOMS_RARES   1903    1285
4          1  _PRENOMS_RARES   1904    1427
...      ...             ...    ...     ...
652051     2           ZYNEB   2016       6
652052     2           ZYNEB   2017       6
652053     2           ZYNEB   2018       5
652054     2           ZYNEB   2019       7
652055     2           ZYNEB   XXXX      19

[652056 rows x 4 columns]

In [ ]:
# Note : 1 = homme, 2 = femme. test

In [3]:
recherche = 'PHILEMON', '2000'
for i in range(652056):
    if prenoms['preusuel'][i] == recherche[0]:
        if prenoms['annais'][i] == recherche[1]:
            print("Il y a eu " + str(prenoms['nombre'][i]) + " " + recherche[0] + " en " + recherche[1] + ".")

Il y a eu 21 PHILEMON en 2000.